zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SECCON.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SECCON
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_SECCON.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for SECCON
 *
 * CMSIS Peripheral Access Layer for SECCON
 */

#if !defined(PERI_SECCON_H_)
#define PERI_SECCON_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SECCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SECCON_Peripheral_Access_Layer SECCON Peripheral Access Layer
 * @{
 */

/** SECCON - Size of Registers Arrays */
#define SECCON_GDETX_CTRL_COUNT                   1u

/** SECCON - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[80];
  __IO uint32_t CPU0STCKCAL;                       /**< Secure CPU0 System Tick Calibration, offset: 0x50 */
       uint8_t RESERVED_1[1480];
  __IO uint32_t MSFCFG;                            /**< MSF Configuration, offset: 0x61C */
       uint8_t RESERVED_2[28];
  __I  uint32_t CFPA_LC_STATE;                     /**< CFPA State Register, offset: 0x63C */
       uint8_t RESERVED_3[24];
  __IO uint32_t RAM_XEN;                           /**< RAM XEN Control, offset: 0x658 */
  __IO uint32_t RAM_XEN_DP;                        /**< RAM XEN Control (Duplicate), offset: 0x65C */
       uint8_t RESERVED_4[12];
  __IO uint32_t GDET_CTRL[SECCON_GDETX_CTRL_COUNT]; /**< GDET0 Control Register, array offset: 0x66C, array step: 0x4 */
       uint8_t RESERVED_5[16];
  __I  uint32_t ELS_OTP_LC_STATE;                  /**< Life Cycle State Register, offset: 0x680 */
  __I  uint32_t ELS_OTP_LC_STATE_DP;               /**< Life Cycle State Register (Duplicate), offset: 0x684 */
       uint8_t RESERVED_6[280];
  __IO uint32_t DEBUG_LOCK_EN;                     /**< Control Write Access to Security, offset: 0x7A0 */
  __IO uint32_t DEBUG_FEATURES;                    /**< Cortex Debug Features Control, offset: 0x7A4 */
  __IO uint32_t DEBUG_FEATURES_DP;                 /**< Cortex Debug Features Control (Duplicate), offset: 0x7A8 */
       uint8_t RESERVED_7[8];
  __IO uint32_t SWD_ACCESS_CPU0;                   /**< CPU0 Software Debug Access, offset: 0x7B4 */
       uint8_t RESERVED_8[8];
  __IO uint32_t DEBUG_AUTH_BEACON;                 /**< Debug Authentication BEACON, offset: 0x7C0 */
} SECCON_Type;

/* ----------------------------------------------------------------------------
   -- SECCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SECCON_Register_Masks SECCON Register Masks
 * @{
 */

/*! @name CPU0STCKCAL - Secure CPU0 System Tick Calibration */
/*! @{ */

#define SECCON_CPU0STCKCAL_TENMS_MASK            (0xFFFFFFU)
#define SECCON_CPU0STCKCAL_TENMS_SHIFT           (0U)
/*! TENMS - Reload value for 10 ms (100 Hz) timing, subject to system clock skew errors. If the
 *    value reads as zero, the calibration value is not known.
 */
#define SECCON_CPU0STCKCAL_TENMS(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0STCKCAL_TENMS_SHIFT)) & SECCON_CPU0STCKCAL_TENMS_MASK)

#define SECCON_CPU0STCKCAL_SKEW_MASK             (0x1000000U)
#define SECCON_CPU0STCKCAL_SKEW_SHIFT            (24U)
/*! SKEW - Whether the TENMS value is exact.
 *  0b0..TENMS value is exact
 *  0b1..TENMS value is not exact or not given
 */
#define SECCON_CPU0STCKCAL_SKEW(x)               (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0STCKCAL_SKEW_SHIFT)) & SECCON_CPU0STCKCAL_SKEW_MASK)

#define SECCON_CPU0STCKCAL_NOREF_MASK            (0x2000000U)
#define SECCON_CPU0STCKCAL_NOREF_SHIFT           (25U)
/*! NOREF - Whether the device provides a reference clock to the processor.
 *  0b0..Reference clock is provided
 *  0b1..No reference clock is provided
 */
#define SECCON_CPU0STCKCAL_NOREF(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0STCKCAL_NOREF_SHIFT)) & SECCON_CPU0STCKCAL_NOREF_MASK)
/*! @} */

/*! @name MSFCFG - MSF Configuration */
/*! @{ */

#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS0_MASK (0x1U)
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS0_SHIFT (0U)
/*! IFR_BLOCK0_ERASE_DIS0 - user IFR block0 sector 0 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS0(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS0_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS0_MASK)

#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS1_MASK (0x2U)
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS1_SHIFT (1U)
/*! IFR_BLOCK0_ERASE_DIS1 - user IFR block0 sector 1 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS1(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS1_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS1_MASK)

#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS2_MASK (0x4U)
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS2_SHIFT (2U)
/*! IFR_BLOCK0_ERASE_DIS2 - user IFR block0 sector 2 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS2(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS2_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS2_MASK)

#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS3_MASK (0x8U)
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS3_SHIFT (3U)
/*! IFR_BLOCK0_ERASE_DIS3 - user IFR block0 sector 3 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS3(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS3_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK0_ERASE_DIS3_MASK)

