zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SECCON.h
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS0_MASK (0x10U)
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS0_SHIFT (4U)
/*! IFR_BLOCK1_ERASE_DIS0 - user IFR block1 sector 0 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS0(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS0_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS0_MASK)

#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS1_MASK (0x20U)
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS1_SHIFT (5U)
/*! IFR_BLOCK1_ERASE_DIS1 - user IFR block1 sector 1 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS1(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS1_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS1_MASK)

#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS2_MASK (0x40U)
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS2_SHIFT (6U)
/*! IFR_BLOCK1_ERASE_DIS2 - user IFR block1 sector 2 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS2(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS2_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS2_MASK)

#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS3_MASK (0x80U)
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS3_SHIFT (7U)
/*! IFR_BLOCK1_ERASE_DIS3 - user IFR block1 sector 3 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS3(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS3_SHIFT)) & SECCON_MSFCFG_IFR_BLOCK1_ERASE_DIS3_MASK)

#define SECCON_MSFCFG_MASS_ERASE_DIS_MASK        (0x100U)
#define SECCON_MSFCFG_MASS_ERASE_DIS_SHIFT       (8U)
/*! MASS_ERASE_DIS - Mass erase control
 *  0b0..Enables mass erase
 *  0b1..Disables mass erase, write one lock until a system reset.
 */
#define SECCON_MSFCFG_MASS_ERASE_DIS(x)          (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_MASS_ERASE_DIS_SHIFT)) & SECCON_MSFCFG_MASS_ERASE_DIS_MASK)

#define SECCON_MSFCFG_CG_OVERRIDE_MASK           (0x10000U)
#define SECCON_MSFCFG_CG_OVERRIDE_SHIFT          (16U)
/*! CG_OVERRIDE - FMU CG override
 *  0b0..FMU access clock gating is enabled.
 *  0b1..FMU access clock gating is disabled.
 */
#define SECCON_MSFCFG_CG_OVERRIDE(x)             (((uint32_t)(((uint32_t)(x)) << SECCON_MSFCFG_CG_OVERRIDE_SHIFT)) & SECCON_MSFCFG_CG_OVERRIDE_MASK)
/*! @} */

/*! @name CFPA_LC_STATE - CFPA State Register */
/*! @{ */

#define SECCON_CFPA_LC_STATE_CFPA_LC_STATE_MASK  (0xFFFFFFFFU)
#define SECCON_CFPA_LC_STATE_CFPA_LC_STATE_SHIFT (0U)
/*! CFPA_LC_STATE - CFPA state */
#define SECCON_CFPA_LC_STATE_CFPA_LC_STATE(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CFPA_LC_STATE_CFPA_LC_STATE_SHIFT)) & SECCON_CFPA_LC_STATE_CFPA_LC_STATE_MASK)
/*! @} */

/*! @name RAM_XEN - RAM XEN Control */
/*! @{ */

#define SECCON_RAM_XEN_RAMX0_XEN_MASK            (0x1U)
#define SECCON_RAM_XEN_RAMX0_XEN_SHIFT           (0U)
/*! RAMX0_XEN - RAMX0 to RAMX3 Execute Permission Control.
 *  0b0..Execute permission is disabled, R/W are enabled.
 *  0b1..Execute permission is enabled, R/W/X are enabled.
 */
#define SECCON_RAM_XEN_RAMX0_XEN(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_RAMX0_XEN_SHIFT)) & SECCON_RAM_XEN_RAMX0_XEN_MASK)

#define SECCON_RAM_XEN_RAMA0_XEN_MASK            (0x4U)
#define SECCON_RAM_XEN_RAMA0_XEN_SHIFT           (2U)
/*! RAMA0_XEN - RAMA0 Execute Permission Control.
 *  0b0..Execute permission is disabled, R/W are enabled.
 *  0b1..Execute permission is enabled, R/W/X are enabled.
 */
#define SECCON_RAM_XEN_RAMA0_XEN(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_RAMA0_XEN_SHIFT)) & SECCON_RAM_XEN_RAMA0_XEN_MASK)

#define SECCON_RAM_XEN_RAMA1_XEN_MASK            (0x8U)
#define SECCON_RAM_XEN_RAMA1_XEN_SHIFT           (3U)
/*! RAMA1_XEN - RAMAx (excluding RAMA0) Execute Permission Control.
 *  0b0..Execute permission is disabled, R/W are enabled.
 *  0b1..Execute permission is enabled, R/W/X are enabled.
 */
#define SECCON_RAM_XEN_RAMA1_XEN(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_RAMA1_XEN_SHIFT)) & SECCON_RAM_XEN_RAMA1_XEN_MASK)

#define SECCON_RAM_XEN_RAMB_XEN_MASK             (0x10U)
#define SECCON_RAM_XEN_RAMB_XEN_SHIFT            (4U)
/*! RAMB_XEN - RAMBx Execute Permission Control.
 *  0b0..Execute permission is disabled, R/W are enabled.
 *  0b1..Execute permission is enabled, R/W/X are enabled.
 */
#define SECCON_RAM_XEN_RAMB_XEN(x)               (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_RAMB_XEN_SHIFT)) & SECCON_RAM_XEN_RAMB_XEN_MASK)

#define SECCON_RAM_XEN_LOCK_MASK                 (0x80000000U)
#define SECCON_RAM_XEN_LOCK_SHIFT                (31U)
/*! LOCK - This 1-bit field provides a mechanism to limit writes to this register (and RAM_XEN_DP)
 *    to protect its contents. Once set, this bit remains asserted until a system reset.
 *  0b0..This register is not locked and can be altered.
 *  0b1..This register is locked and cannot be altered.
 */
#define SECCON_RAM_XEN_LOCK(x)                   (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_LOCK_SHIFT)) & SECCON_RAM_XEN_LOCK_MASK)
/*! @} */

/*! @name RAM_XEN_DP - RAM XEN Control (Duplicate) */
/*! @{ */

#define SECCON_RAM_XEN_DP_RAMX0_XEN_MASK         (0x1U)
#define SECCON_RAM_XEN_DP_RAMX0_XEN_SHIFT        (0U)
/*! RAMX0_XEN - Refer to RAM_XEN for more details. */
#define SECCON_RAM_XEN_DP_RAMX0_XEN(x)           (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_DP_RAMX0_XEN_SHIFT)) & SECCON_RAM_XEN_DP_RAMX0_XEN_MASK)

#define SECCON_RAM_XEN_DP_RAMA0_XEN_MASK         (0x4U)
#define SECCON_RAM_XEN_DP_RAMA0_XEN_SHIFT        (2U)
/*! RAMA0_XEN - Refer to RAM_XEN for more details. */
#define SECCON_RAM_XEN_DP_RAMA0_XEN(x)           (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_DP_RAMA0_XEN_SHIFT)) & SECCON_RAM_XEN_DP_RAMA0_XEN_MASK)

