zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SECCON.h
#define SECCON_RAM_XEN_DP_RAMA1_XEN_MASK         (0x8U)
#define SECCON_RAM_XEN_DP_RAMA1_XEN_SHIFT        (3U)
/*! RAMA1_XEN - Refer to RAM_XEN for more details. */
#define SECCON_RAM_XEN_DP_RAMA1_XEN(x)           (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_DP_RAMA1_XEN_SHIFT)) & SECCON_RAM_XEN_DP_RAMA1_XEN_MASK)

#define SECCON_RAM_XEN_DP_RAMB_XEN_MASK          (0x10U)
#define SECCON_RAM_XEN_DP_RAMB_XEN_SHIFT         (4U)
/*! RAMB_XEN - Refer to RAM_XEN for more details. */
#define SECCON_RAM_XEN_DP_RAMB_XEN(x)            (((uint32_t)(((uint32_t)(x)) << SECCON_RAM_XEN_DP_RAMB_XEN_SHIFT)) & SECCON_RAM_XEN_DP_RAMB_XEN_MASK)
/*! @} */

/*! @name GDETX_CTRL_GDET_CTRL - GDET0 Control Register */
/*! @{ */

#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_EVTCNT_CLR_MASK (0x1U)
#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_EVTCNT_CLR_SHIFT (0U)
/*! GDET_EVTCNT_CLR - Controls the GDET0 clean event counter
 *  0b0..Event counter not cleared
 *  0b1..Clears event counter
 */
#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_EVTCNT_CLR(x) (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_GDET_EVTCNT_CLR_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_GDET_EVTCNT_CLR_MASK)

#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_ERR_CLR_MASK (0x2U)
#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_ERR_CLR_SHIFT (1U)
/*! GDET_ERR_CLR - Clears GDET0 error status
 *  0b0..Error status not cleared
 *  0b1..Clears error status
 */
#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_ERR_CLR(x) (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_GDET_ERR_CLR_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_GDET_ERR_CLR_MASK)

#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_ISO_SW_MASK (0xCU)
#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_ISO_SW_SHIFT (2U)
/*! GDET_ISO_SW - GDET0 isolation control
 *  0b00..Isolation is disabled
 *  0b01..Isolation is disabled
 *  0b10..Isolation is enabled. When GDET0_CTRL GDET_ISO_SW are "10", isolation_on is asserted.
 *  0b11..Isolation is disabled
 */
#define SECCON_GDETX_CTRL_GDET_CTRL_GDET_ISO_SW(x) (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_GDET_ISO_SW_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_GDET_ISO_SW_MASK)

#define SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CNT_MASK (0xFF00U)
#define SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CNT_SHIFT (8U)
/*! EVENT_CNT - Event count value */
#define SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CNT(x) (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CNT_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CNT_MASK)

#define SECCON_GDETX_CTRL_GDET_CTRL_POS_SYNC_MASK (0x10000U)
#define SECCON_GDETX_CTRL_GDET_CTRL_POS_SYNC_SHIFT (16U)
/*! POS_SYNC - Positive glitch detected
 *  0b0..Positive glitch not detected
 *  0b1..Positive glitch detected
 */
#define SECCON_GDETX_CTRL_GDET_CTRL_POS_SYNC(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_POS_SYNC_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_POS_SYNC_MASK)

#define SECCON_GDETX_CTRL_GDET_CTRL_NEG_SYNC_MASK (0x20000U)
#define SECCON_GDETX_CTRL_GDET_CTRL_NEG_SYNC_SHIFT (17U)
/*! NEG_SYNC - Negative glitch detected
 *  0b0..Negative glitch not detected
 *  0b1..Negative glitch detected
 */
#define SECCON_GDETX_CTRL_GDET_CTRL_NEG_SYNC(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_NEG_SYNC_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_NEG_SYNC_MASK)

#define SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CLR_FLAG_MASK (0x40000U)
#define SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CLR_FLAG_SHIFT (18U)
/*! EVENT_CLR_FLAG - Event counter cleared
 *  0b0..Event counter not cleared
 *  0b1..Event counter cleared
 */
#define SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CLR_FLAG(x) (((uint32_t)(((uint32_t)(x)) << SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CLR_FLAG_SHIFT)) & SECCON_GDETX_CTRL_GDET_CTRL_EVENT_CLR_FLAG_MASK)
/*! @} */

/* The count of SECCON_GDETX_CTRL_GDET_CTRL */
#define SECCON_GDETX_CTRL_GDET_CTRL_COUNT        (1U)

/*! @name ELS_OTP_LC_STATE - Life Cycle State Register */
/*! @{ */

#define SECCON_ELS_OTP_LC_STATE_OTP_LC_STATE_MASK (0xFFU)
#define SECCON_ELS_OTP_LC_STATE_OTP_LC_STATE_SHIFT (0U)
/*! OTP_LC_STATE - OTP life cycle state */
#define SECCON_ELS_OTP_LC_STATE_OTP_LC_STATE(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_ELS_OTP_LC_STATE_OTP_LC_STATE_SHIFT)) & SECCON_ELS_OTP_LC_STATE_OTP_LC_STATE_MASK)
/*! @} */

/*! @name ELS_OTP_LC_STATE_DP - Life Cycle State Register (Duplicate) */
/*! @{ */

#define SECCON_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_MASK (0xFFU)
#define SECCON_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_SHIFT (0U)
/*! OTP_LC_STATE_DP - OTP life cycle state */
#define SECCON_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP(x) (((uint32_t)(((uint32_t)(x)) << SECCON_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_SHIFT)) & SECCON_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_MASK)
/*! @} */

/*! @name DEBUG_LOCK_EN - Control Write Access to Security */
/*! @{ */

#define SECCON_DEBUG_LOCK_EN_LOCK_ALL_MASK       (0xFU)
#define SECCON_DEBUG_LOCK_EN_LOCK_ALL_SHIFT      (0U)
/*! LOCK_ALL - Controls write access to the security registers
 *  0b0000..Any other value than b1010: disables write access to all registers
 *  0b1010..Enables write access to all registers
 */
#define SECCON_DEBUG_LOCK_EN_LOCK_ALL(x)         (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_LOCK_EN_LOCK_ALL_SHIFT)) & SECCON_DEBUG_LOCK_EN_LOCK_ALL_MASK)
/*! @} */

/*! @name DEBUG_FEATURES - Cortex Debug Features Control */
/*! @{ */

#define SECCON_DEBUG_FEATURES_CPU0_DBGEN_MASK    (0x3U)
#define SECCON_DEBUG_FEATURES_CPU0_DBGEN_SHIFT   (0U)
/*! CPU0_DBGEN - CPU0 invasive debug control
 *  0b01..Disables debug
 *  0b10..Enables debug
 */
#define SECCON_DEBUG_FEATURES_CPU0_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURES_CPU0_DBGEN_SHIFT)) & SECCON_DEBUG_FEATURES_CPU0_DBGEN_MASK)

#define SECCON_DEBUG_FEATURES_CPU0_NIDEN_MASK    (0xCU)
#define SECCON_DEBUG_FEATURES_CPU0_NIDEN_SHIFT   (2U)
/*! CPU0_NIDEN - CPU0 non-invasive debug control
 *  0b01..Disables debug
 *  0b10..Enables debug
 */
#define SECCON_DEBUG_FEATURES_CPU0_NIDEN(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURES_CPU0_NIDEN_SHIFT)) & SECCON_DEBUG_FEATURES_CPU0_NIDEN_MASK)

#define SECCON_DEBUG_FEATURES_CPU0_SPIDEN_MASK   (0x30U)
#define SECCON_DEBUG_FEATURES_CPU0_SPIDEN_SHIFT  (4U)
/*! CPU0_SPIDEN - CPU0 secure privileged invasive debug control
 *  0b01..Disables debug
 *  0b10..Enables debug
 */
#define SECCON_DEBUG_FEATURES_CPU0_SPIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURES_CPU0_SPIDEN_SHIFT)) & SECCON_DEBUG_FEATURES_CPU0_SPIDEN_MASK)

#define SECCON_DEBUG_FEATURES_CPU0_SPNIDEN_MASK  (0xC0U)
#define SECCON_DEBUG_FEATURES_CPU0_SPNIDEN_SHIFT (6U)
/*! CPU0_SPNIDEN - CPU0 secure privileged non-invasive debug control
 *  0b01..Disables debug
 *  0b10..Enables debug
 */
#define SECCON_DEBUG_FEATURES_CPU0_SPNIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURES_CPU0_SPNIDEN_SHIFT)) & SECCON_DEBUG_FEATURES_CPU0_SPNIDEN_MASK)
/*! @} */

/*! @name DEBUG_FEATURES_DP - Cortex Debug Features Control (Duplicate) */
/*! @{ */

